fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВКМ_ГрафикОтпусков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтпускаСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_АнализГрафика/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Получаем данные из временного хранилища
	АдресХранилища = Параметры.АдресДанных;
	Если АдресХранилища = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТЧ = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	// 2. Очищаем диаграмму (это удалит "Точку 1" и "Серию 1")
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	// 3. Создаем одну единственную Серию
	СерияОтпуск = Диаграмма.УстановитьСерию("Отпуска сотрудников");
	
	// 4. Заполняем диаграмму данными из таблицы
	Для Каждого Стр Из ДанныеТЧ Цикл
		
		// Пропускаем строки без сотрудника или дат
		Если Не ЗначениеЗаполнено(Стр.Сотрудник) ИЛИ Не ЗначениеЗаполнено(Стр.ДатаНачала) Тогда 
			Продолжить; 
		КонецЕсли;
		
		// Создаем или получаем Точку (строку на диаграмме для конкретного сотрудника)
		ТочкаСотрудник = Диаграмма.УстановитьТочку(Стр.Сотрудник);
		ТочкаСотрудник.Текст = Строка(Стр.Сотрудник);
		
		// Получаем "ячейку" на пересечении Сотрудника и Серии отпусков
		Значение = Диаграмма.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		
		// Добавляем полоску отпуска
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец  = КонецДня(Стр.ДатаОкончания);
		
		// Текст, который будет виден на самой полоске
		Интервал.Текст = Формат(Стр.ДатаНачала, "ДФ=dd.MM") + " - " + Формат(Стр.ДатаОкончания, "ДФ=dd.MM");
		
	КонецЦикла;
	
	// Включаем отрисовку — диаграмма сама подберет масштаб под ваши даты
	Диаграмма.Обновление = Истина;	
КонецПроцедуры
